# **笔记：《统计学习方法》之逻辑回归与最大熵模型**

## 目录

-概述

-逻辑回归

-最大熵模型

-小故事：关于局部最优和全局最优

## 1. 概述
   
逻辑回归与最大熵模型都是用于处理分类问题的模型，与感知机粗暴地输出是或否不同的是，这两者会输出概率，使得我们可以更好地处理分类问题，更加贴近真实情景。

实际上，逻辑回归与最大熵模型在二元条件下会输出同样的结果（等价形式）。

逻辑回归的构想十分自然且有趣，我们将从感知机出发，一步步将感知机的不足修正，最后变成逻辑回归。

而最大熵模型的本质思想也很朴素，其实只是一个“求解方程”的过程，通过数学变化巧妙地将历史与现实连接起来

## 2. 模型：逻辑回归

1. 从感知机的引入

在学习逻辑回归之前，我们先简单复习一下感知机的内容。感知机也是一类分类模型，但是它只能处理线性可分数据，并且只能输出是或不是的死板结果（位于超平面的哪一侧）

在实际情景中，我们会发现我们对于模型的要求不止这么简单，我们希望得到具体的概率。那么能用什么来连接原有的分类和概率呢？一个自然的想法是，距离。

在感知机中，同一侧样本关于超平面的距离是不一致的，这个距离是不同样本之间的差值，它可以变成一个具体的量——可信度，也就是概率的雏形。

具体来说就是，距离超平面越近，越容易被误分类，越不可信，反之亦然。那么，有了这个置信度，怎么变成概率呢？

首先，距离的值域是负无穷到正无穷，概率的值域是（0，1）



   


## 3. 模型

刚刚我们已经知道了，感知机输出的结果，也就是模型，是一个超平面。其函数为f(x)=sign(wx+b)。
   
我们的目的就是训练模型，使其返回给我们一个w和b的值，实现我们“分水果”的目的.

## 4. 策略
  
何为策略？策略就是如何评价模型的一个指标，也叫损失函数。

这个指标具有以下特征：

1.通过这个指标反映模型对目标的完成效果。

2.该指标与模型的参数直接要有相关性，在感知机中，该指标（损失函数）就是w和b的连续可导函数。

结合感知机“分水果”这一动作，我们很自然地想到，利用“错分水果的数量”来衡量感知机对目标的完成效果。但仔细一想，这不好。

为什么呢？

放到数学情景中你就知道了。
  
误分类点数这一数值与感知机输出的参数毫无关联，想要知道有多少个点被误分类我们只能一个个去数，去算，我们并不能将其与w和b关联起来。

因此，我们想到了利用误分类点到超平面的总距离来作为策略——距离可以反映感知机的分类情况，如果总距离很大，证明这时候的参数离正确分类还很远，还得调。如果总距离很小，那么就说明接近正确参数了。如果总距离为0，就说明所有点都是被正确分类的了，目标完成。
  
更重要的是，用总距离这个指标，可以让w和b也参与进来了，公式为：(1/||w||)*|wx+b|。其中||w||是w的L2范数，也就是距离的意思。
  
  !!!(缺少说明，为什么可以丢掉范数)
  通过这个指标，我们可以建立结果与标准的关系，进行迭代
 
所以，感知机的损失函数是：$ L(w, b) = -\sum_{x_i \in M} y_i (w \cdot x_i + b)$    

我们的目标是使损失函数为0。

## 5. 算法
  
何为算法？算法就是在符合策略的条件下得到最佳模型的方法

感知机采用的算法是随机梯度下降法。把感知机求解的过程想象成下山，随机梯度下降就是找到坡度最陡的方向进而向该方向移动。每移动一步，就再找最陡方向，直到下山

梯度的数学含义是什么呢？其实是损失函数对w和b求偏导的向量形式。

首先解释下偏导，偏导的意思是，在一个具有很多变量的式子里，将剩下的变量当作常量，只对一个变量求导。偏导的目的是判断每个变量的重要程度，最重要的部分相当于“最陡”的方向

w和b的梯度公式：
$$
\frac{\partial L}{\partial w} = -\sum_{x_i \in M} y_i x_i
$$ 

$$
\frac{\partial L}{\partial b} = -\sum_{x_i \in M} y_i 
$$ 

接着，朝着最陡的方向移动，在数学上也就是对w和b进行更新。
$$
w \leftarrow w + \eta \sum_{x_i \in M} y_i x_i 
$$ 

$$
b \leftarrow b + \eta \sum_{x_i \in M} y_i 
$$  
其中，eta是学习率，也就是步长。即每次往最陡的方向移动多少。学习率越低，训练的结果越准确。

## 5. 对偶形式

## 6. 收敛性
收敛性是什么？有什么用？简单来说，收敛性就是证明“感知机不会无限循环，而是只要满足了特定情况就必定可以中止的必要性证明。

其公式为： $k \leq \left(\frac{\gamma}{R}\right)^2$

其中，k表示更新次数，R表示数据集中离原点最远的点到原点的距离，γ是正负两类样本之间的最小间距。

这个公式说明了，假如两类数据分的很开，那感知机找到结果的次数就少，反之亦然。
      
